/*
 * data.c
 *
 *  Created on: 2024/08/18
 *      Author: 180018
 */
#include "data.h"

/*===== 構造体宣言 =================================================================================*/

/*===== マクロ定義 =================================================================================*/


/*===== モード定義 =================================================================================*/


/*===== 外部変数宣言 ===============================================================================*/
float  g_fTemp1;                                                    /* 温度センサー 入力値(℃)      */
float  g_fPressure1;                                                /* 圧力センサー 入力値(Pa)      */
int    g_iPressState;                                               /* 圧力制御状態                 */
int    g_iTempState;                                                /* 温度制御状態                 */
const COOKING_RECIPES   g_CookingRecipes =                          /* 調理レシピ                   */
{
    300000,                                                         /* 温度圧力さらし時間(ms)       */
    40,                                                             /* 温度SV値(℃)                 */
    -80,                                                            /* 圧力SV値(Pa)                 */
    60000,                                                          /* 大気圧さらし時間(ms)         */
    5                                                               /* 湿潤繰り返し回数             */
};
unsigned long       g_ulPVTime;                                     /* 温度圧力さらし経過時間       */
unsigned long       g_ulPressureReleasePVTime;                      /* 大気圧さらし経過時間         */
unsigned long       g_ulSoakLoopPVCount;		                    /* 調理ステップ					*/
int    g_iLED1State;                                                /* LED1状態                     */
int    g_iLED2State;                                                /* LED2状態                     */
int    g_iLED3State;                                                /* LED3状態                     */

                                                                    
/*===== 外部関数宣言 ===============================================================================*/



