/*
 * measure.c
 *
 *  Created on: 2024/08/18
 *      Author: 180018
 */
#include <tk/tkernel.h>
#include <tm/tmonitor.h>
#include "data.h"

/*===== 変数宣言 ===================================================================================*/

/*===== 関数定義 ===================================================================================*/
static  void    __task_measure_init( void );

/*==============================================================================*/
/*  関数名 : task_measure()                                                     */
/*  機能  : 計測タスク処理                                                     */
/*==============================================================================*/
void task_measure(INT stacd, void *exinf)
{
/*--------------------------------------------------------------------------------------------------*/
    UW adc_val1, adc_val2;
    ID dd;     // デバイスディスクリプタ
    ER err;    // エラーコード

    __task_measure_init();                                              /* 計測タスク初期化処理         */
    tk_slp_tsk(TMO_FEVR);                                               /* タスクスリープ。               */

    dd = tk_opn_dev((UB*)"hadca", TD_UPDATE);                           // デバイスのオープン

    /*--- 計測タスク定周期処理 --------------------------------------------------------------------------*/
    while( 1 )
    {
        tm_printf((UB*)"\nタスクmeasure起床\n");
        err = tk_srea_dev(dd, 0, &adc_val1, 1, NULL);   // A/DC チャンネル0からデータを取得
        err = tk_srea_dev(dd, 4, &adc_val2, 1, NULL);   // A/DC チャンネル1からデータを取得

        // 圧力スケーリングの計算 AD値0~4095を、圧力値0~-101.33kpaへスケーリング
        //g_fPressure1 = adc_val1 * (-101.33 / 4095.0) +7;
        g_fPressure1 = adc_val1 * (-82.50 / 4095.0) +7;
        // 温度スケーリングの計算 AD値0~4095を、温度値0~100℃へスケーリング
        g_fTemp1 = adc_val2 * (100.0 / 4095.0);

        //tm_printf((UB*)"A/DC A0 =%06d A/DC A1 =%06d\n", adc_val1, adc_val2);    // デバッグ出力
        tm_printf((UB*)"g_fPressure1 = %d kpa (adc_val1 = %d) \n",  (int)(g_fPressure1 + 0.5),adc_val1);    // 温度の出力（四捨五入して整数で表示）
        tm_printf((UB*)"g_fTemp1 = %d C\n", (int)(g_fTemp1 + 0.5));    // 温度の出力（四捨五入して整数で表示）
        //tk_dly_tsk(500);       // デバッグ用　500ms待ち
        tk_slp_tsk(TMO_FEVR);                                               /* タスクスリープ。               */
    }
}
/* end of task_measure() */


/*------------------------------------------------------------------------------*/
/*  関数名 : __task_measure_init()                                               */
/*  機能  : 計測タスク初期化処理                                             */
/*------------------------------------------------------------------------------*/
static  void    __task_measure_init( void )
{
}
/* end of __task_measure_init() */
